; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-7-8)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	p0-6 - location
	p0-8 - location
	p0-9 - location
	p1-7 - location
	p2-5 - location
	p2-6 - location
	p3-0 - location
	p3-1 - location
	p3-4 - location
	p4-2 - location
	p6-11 - location
	p7-3 - location
	p7-5 - location
	p7-10 - location
	p8-1 - location
	p8-10 - location
	p8-11 - location
	p9-2 - location
	p9-5 - location
	p11-2 - location
	p11-10 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s11)
	(at driver3 s5)
	(at truck1 s8)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s2)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s7)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s4)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s0)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s10)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at truck7 s7)
	(empty truck7)
	(= (load truck7) 0)
	(= (fuel-per-minute truck7) 10)
	(at package1 s6)
	(at package2 s1)
	(at package3 s4)
	(at package4 s1)
	(at package5 s2)
	(at package6 s5)
	(at package7 s6)
	(at package8 s0)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s0 p0-8)
	(path p0-8 s0)
	(path s8 p0-8)
	(path p0-8 s8)
	(path s0 p0-9)
	(path p0-9 s0)
	(path s9 p0-9)
	(path p0-9 s9)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(path s6 p6-11)
	(path p6-11 s6)
	(path s11 p6-11)
	(path p6-11 s11)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(path s7 p7-10)
	(path p7-10 s7)
	(path s10 p7-10)
	(path p7-10 s10)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(path s8 p8-10)
	(path p8-10 s8)
	(path s10 p8-10)
	(path p8-10 s10)
	(path s8 p8-11)
	(path p8-11 s8)
	(path s11 p8-11)
	(path p8-11 s11)
	(path s9 p9-2)
	(path p9-2 s9)
	(path s2 p9-2)
	(path p9-2 s2)
	(path s9 p9-5)
	(path p9-5 s9)
	(path s5 p9-5)
	(path p9-5 s5)
	(path s11 p11-2)
	(path p11-2 s11)
	(path s2 p11-2)
	(path p11-2 s2)
	(path s11 p11-10)
	(path p11-10 s11)
	(path s10 p11-10)
	(path p11-10 s10)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 15)
	(= (time-to-drive s5 s0) 15)
	(link s0 s11)
	(link s11 s0)
	(= (time-to-drive s0 s11) 47)
	(= (time-to-drive s11 s0) 47)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 58)
	(= (time-to-drive s0 s1) 58)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 89)
	(= (time-to-drive s4 s1) 89)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 82)
	(= (time-to-drive s0 s2) 82)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 84)
	(= (time-to-drive s4 s2) 84)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 5)
	(= (time-to-drive s5 s2) 5)
	(link s2 s8)
	(link s8 s2)
	(= (time-to-drive s2 s8) 4)
	(= (time-to-drive s8 s2) 4)
	(link s2 s11)
	(link s11 s2)
	(= (time-to-drive s2 s11) 35)
	(= (time-to-drive s11 s2) 35)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 81)
	(= (time-to-drive s1 s3) 81)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 91)
	(= (time-to-drive s3 s4) 91)
	(link s4 s8)
	(link s8 s4)
	(= (time-to-drive s4 s8) 28)
	(= (time-to-drive s8 s4) 28)
	(link s4 s10)
	(link s10 s4)
	(= (time-to-drive s4 s10) 86)
	(= (time-to-drive s10 s4) 86)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 37)
	(= (time-to-drive s1 s5) 37)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 74)
	(= (time-to-drive s3 s5) 74)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 54)
	(= (time-to-drive s6 s5) 54)
	(link s5 s11)
	(link s11 s5)
	(= (time-to-drive s5 s11) 63)
	(= (time-to-drive s11 s5) 63)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 26)
	(= (time-to-drive s0 s6) 26)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 87)
	(= (time-to-drive s1 s6) 87)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 38)
	(= (time-to-drive s2 s6) 38)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 72)
	(= (time-to-drive s3 s6) 72)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 69)
	(= (time-to-drive s1 s7) 69)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 34)
	(= (time-to-drive s5 s7) 34)
	(link s7 s9)
	(link s9 s7)
	(= (time-to-drive s7 s9) 10)
	(= (time-to-drive s9 s7) 10)
	(link s7 s11)
	(link s11 s7)
	(= (time-to-drive s7 s11) 64)
	(= (time-to-drive s11 s7) 64)
	(link s8 s1)
	(link s1 s8)
	(= (time-to-drive s8 s1) 72)
	(= (time-to-drive s1 s8) 72)
	(link s8 s10)
	(link s10 s8)
	(= (time-to-drive s8 s10) 66)
	(= (time-to-drive s10 s8) 66)
	(link s9 s6)
	(link s6 s9)
	(= (time-to-drive s9 s6) 25)
	(= (time-to-drive s6 s9) 25)
	(link s9 s11)
	(link s11 s9)
	(= (time-to-drive s9 s11) 83)
	(= (time-to-drive s11 s9) 83)
	(link s10 s6)
	(link s6 s10)
	(= (time-to-drive s10 s6) 95)
	(= (time-to-drive s6 s10) 95)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 65)
	(= (time-to-drive s7 s10) 65)
	(link s11 s3)
	(link s3 s11)
	(= (time-to-drive s11 s3) 97)
	(= (time-to-drive s3 s11) 97)
	(link s11 s4)
	(link s4 s11)
	(= (time-to-drive s11 s4) 41)
	(= (time-to-drive s4 s11) 41)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver3 s8)
	(at truck4 s2)
	(at truck5 s8)
	(at truck6 s8)
	(at package1 s3)
	(at package2 s3)
	(at package3 s8)
	(at package4 s4)
	(at package5 s7)
	(at package6 s3)
	(at package7 s7)
	(at package8 s7)
	))

(:metric minimize (+ (* 1 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (walk driver3 s5 p2-5)
   deleted: (at driver3 s5)
   added: (at driver3 p2-5)
   goals met: 0 of 13
2. (walk driver3 p2-5 s2)
   deleted: (at driver3 p2-5)
   added: (at driver3 s2)
   goals met: 0 of 13
3. (walk driver2 s11 p11-10)
   deleted: (at driver2 s11)
   added: (at driver2 p11-10)
   goals met: 0 of 13
4. (load-truck package5 truck2 s2)
   deleted: (at package5 s2)
   added: (in package5 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 0 of 13
5. (board-truck driver3 truck2 s2)
   deleted: (at driver3 s2) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 0 of 13
6. (drive-truck truck2 s2 s4 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   changed: (fuel-used) from 0 to 924
   goals met: 0 of 13
7. (load-truck package3 truck2 s4)
   deleted: (at package3 s4)
   added: (in package3 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 0 of 13
8. (walk driver2 p11-10 s10)
   deleted: (at driver2 p11-10)
   added: (at driver2 s10)
   goals met: 0 of 13
9. (drive-truck truck2 s4 s2 driver3)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   changed: (fuel-used) from 924 to 2016
   goals met: 0 of 13
10. (drive-truck truck2 s2 s0 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (fuel-used) from 2016 to 3082
   goals met: 0 of 13
11. (load-truck package8 truck2 s0)
   deleted: (at package8 s0)
   added: (in package8 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 0 of 13
12. (drive-truck truck2 s0 s1 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 3082 to 4010
   goals met: 0 of 13
13. (load-truck package2 truck2 s1)
   deleted: (at package2 s1)
   added: (in package2 truck2)
   changed: (load truck2) from 3 to 4, (fuel-per-minute truck2) from 16 to 20
   goals met: 0 of 13
14. (load-truck package4 truck2 s1)
   deleted: (at package4 s1)
   added: (in package4 truck2)
   changed: (load truck2) from 4 to 5, (fuel-per-minute truck2) from 20 to 25
   goals met: 0 of 13
15. (drive-truck truck2 s1 s4 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (fuel-used) from 4010 to 6235
   goals met: 0 of 13
16. (unload-truck package4 truck2 s4)
   deleted: (in package4 truck2)
   added: (at package4 s4)
   changed: (load truck2) from 5 to 4, (fuel-per-minute truck2) from 25 to 20
   goals met: 1 of 13
17. (drive-truck truck2 s4 s8 driver3)
   deleted: (at truck2 s4)
   added: (at truck2 s8)
   changed: (fuel-used) from 6235 to 6795
   goals met: 1 of 13
18. (unload-truck package3 truck2 s8)
   deleted: (in package3 truck2)
   added: (at package3 s8)
   changed: (load truck2) from 4 to 3, (fuel-per-minute truck2) from 20 to 16
   goals met: 2 of 13
19. (drive-truck truck2 s8 s2 driver3)
   deleted: (at truck2 s8)
   added: (at truck2 s2)
   changed: (fuel-used) from 6795 to 6859
   goals met: 2 of 13
20. (drive-truck truck2 s2 s0 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (fuel-used) from 6859 to 8171
   goals met: 2 of 13
21. (board-truck driver2 truck6 s10)
   deleted: (at driver2 s10) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 2 of 13
22. (drive-truck truck6 s10 s4 driver2)
   deleted: (at truck6 s10)
   added: (at truck6 s4)
   changed: (fuel-used) from 8171 to 9031
   goals met: 2 of 13
23. (drive-truck truck2 s0 s6 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   changed: (fuel-used) from 9031 to 9447
   goals met: 2 of 13
24. (load-truck package1 truck2 s6)
   deleted: (at package1 s6)
   added: (in package1 truck2)
   changed: (load truck2) from 3 to 4, (fuel-per-minute truck2) from 16 to 20
   goals met: 2 of 13
25. (load-truck package7 truck2 s6)
   deleted: (at package7 s6)
   added: (in package7 truck2)
   changed: (load truck2) from 4 to 5, (fuel-per-minute truck2) from 20 to 25
   goals met: 2 of 13
26. (drive-truck truck2 s6 s0 driver3)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   changed: (fuel-used) from 9447 to 10097
   goals met: 2 of 13
27. (drive-truck truck6 s4 s8 driver2)
   deleted: (at truck6 s4)
   added: (at truck6 s8)
   changed: (fuel-used) from 10097 to 10377
   goals met: 3 of 13
28. (drive-truck truck2 s0 s5 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s5)
   changed: (fuel-used) from 10377 to 10752
   goals met: 3 of 13
29. (load-truck package6 truck2 s5)
   deleted: (at package6 s5)
   added: (in package6 truck2)
   changed: (load truck2) from 5 to 6, (fuel-per-minute truck2) from 25 to 31
   goals met: 3 of 13
30. (drive-truck truck2 s5 s0 driver3)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   changed: (fuel-used) from 10752 to 11217
   goals met: 3 of 13
31. (disembark-truck driver2 truck6 s8)
   deleted: (driving driver2 truck6)
   added: (at driver2 s8) (empty truck6)
   goals met: 3 of 13
32. (walk driver2 s8 p0-8)
   deleted: (at driver2 s8)
   added: (at driver2 p0-8)
   goals met: 3 of 13
33. (drive-truck truck2 s0 s1 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 11217 to 13015
   goals met: 3 of 13
34. (walk driver2 p0-8 s0)
   deleted: (at driver2 p0-8)
   added: (at driver2 s0)
   goals met: 3 of 13
35. (board-truck driver2 truck5 s0)
   deleted: (at driver2 s0) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 3 of 13
36. (drive-truck truck5 s0 s2 driver2)
   deleted: (at truck5 s0)
   added: (at truck5 s2)
   changed: (fuel-used) from 13015 to 13835
   goals met: 3 of 13
37. (drive-truck truck5 s2 s8 driver2)
   deleted: (at truck5 s2)
   added: (at truck5 s8)
   changed: (fuel-used) from 13835 to 13875
   goals met: 4 of 13
38. (drive-truck truck2 s1 s3 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (fuel-used) from 13875 to 16386
   goals met: 4 of 13
39. (unload-truck package1 truck2 s3)
   deleted: (in package1 truck2)
   added: (at package1 s3)
   changed: (load truck2) from 6 to 5, (fuel-per-minute truck2) from 31 to 25
   goals met: 5 of 13
40. (unload-truck package6 truck2 s3)
   deleted: (in package6 truck2)
   added: (at package6 s3)
   changed: (load truck2) from 5 to 4, (fuel-per-minute truck2) from 25 to 20
   goals met: 6 of 13
41. (unload-truck package2 truck2 s3)
   deleted: (in package2 truck2)
   added: (at package2 s3)
   changed: (load truck2) from 4 to 3, (fuel-per-minute truck2) from 20 to 16
   goals met: 7 of 13
42. (drive-truck truck2 s3 s1 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   changed: (fuel-used) from 16386 to 17682
   goals met: 7 of 13
43. (drive-truck truck2 s1 s7 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s7)
   changed: (fuel-used) from 17682 to 18786
   goals met: 7 of 13
44. (unload-truck package7 truck2 s7)
   deleted: (in package7 truck2)
   added: (at package7 s7)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 8 of 13
45. (unload-truck package5 truck2 s7)
   deleted: (in package5 truck2)
   added: (at package5 s7)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 9 of 13
46. (unload-truck package8 truck2 s7)
   deleted: (in package8 truck2)
   added: (at package8 s7)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 10 of 13
47. (drive-truck truck2 s7 s1 driver3)
   deleted: (at truck2 s7)
   added: (at truck2 s1)
   changed: (fuel-used) from 18786 to 19476
   goals met: 10 of 13
48. (drive-truck truck2 s1 s8 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s8)
   changed: (fuel-used) from 19476 to 20196
   goals met: 10 of 13
49. (drive-truck truck2 s8 s4 driver3)
   deleted: (at truck2 s8)
   added: (at truck2 s4)
   changed: (fuel-used) from 20196 to 20476
   goals met: 10 of 13
50. (disembark-truck driver3 truck2 s4)
   deleted: (driving driver3 truck2)
   added: (at driver3 s4) (empty truck2)
   goals met: 10 of 13
51. (board-truck driver3 truck4 s4)
   deleted: (at driver3 s4) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 10 of 13
52. (drive-truck truck4 s4 s8 driver3)
   deleted: (at truck4 s4)
   added: (at truck4 s8)
   changed: (fuel-used) from 20476 to 20756
   goals met: 10 of 13
53. (disembark-truck driver3 truck4 s8)
   deleted: (driving driver3 truck4)
   added: (at driver3 s8) (empty truck4)
   goals met: 11 of 13
54. (disembark-truck driver2 truck5 s8)
   deleted: (driving driver2 truck5)
   added: (at driver2 s8) (empty truck5)
   goals met: 11 of 13
55. (board-truck driver3 truck1 s8)
   deleted: (at driver3 s8) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 10 of 13
56. (board-truck driver2 truck4 s8)
   deleted: (at driver2 s8) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 10 of 13
57. (disembark-truck driver3 truck1 s8)
   deleted: (driving driver3 truck1)
   added: (at driver3 s8) (empty truck1)
   goals met: 11 of 13
58. (drive-truck truck4 s8 s1 driver2)
   deleted: (at truck4 s8)
   added: (at truck4 s1)
   changed: (fuel-used) from 20756 to 21476
   goals met: 11 of 13
59. (disembark-truck driver2 truck4 s1)
   deleted: (driving driver2 truck4)
   added: (at driver2 s1) (empty truck4)
   goals met: 11 of 13
60. (board-truck driver1 truck4 s1)
   deleted: (at driver1 s1) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 11 of 13
61. (drive-truck truck4 s1 s4 driver1)
   deleted: (at truck4 s1)
   added: (at truck4 s4)
   changed: (fuel-used) from 21476 to 22366
   goals met: 11 of 13
62. (drive-truck truck4 s4 s2 driver1)
   deleted: (at truck4 s4)
   added: (at truck4 s2)
   changed: (fuel-used) from 22366 to 23206
   goals met: 12 of 13
63. (disembark-truck driver1 truck4 s2)
   deleted: (driving driver1 truck4)
   added: (at driver1 s2) (empty truck4)
   goals met: 13 of 13
